[
    {
        "section": "Education",
        "items": [
            [
                {
                    "row": [
                        "<strong>University of California at Berkeley</strong>",
                        "<em>Expected May 2025</em>"
                    ]
                },
                {
                    "row": [
                        "M.S. in Molecular Science and Software Engineering | GPA: 4.0",
                        "Berkeley, CA"
                    ]
                }
            ],
            [
                {
                    "row": [
                        "<strong>Brigham Young University</strong>",
                        "<em>Apr 2023</em>"
                    ]
                },
                {
                    "row": [
                        "B.S. in Computer Science, emphasis in Software Engineering",
                        "Provo, UT"
                    ]
                }
            ]
        ]
    },
    {
        "section": "Experience",
        "items": [
            [
                {
                    "row": [
                        "<strong>Research Assistant</strong>, Social Technology and Privacy Lab - Provo, UT",
                        "May 2021 - May 2023"
                    ]
                },
                {
                    "list": [
                        "Performed data analysis, including natural language processing, for publications focused on cross cultural interactions and user privacy behavior",
                        "Led prototyping and development of neurodiverse friendly social platform features",
                        "Designed and deployed a lab website, displaying team members and projects for an extensive lab"
                    ]
                }
            ],
            [
                {
                    "row": [
                        "<strong>Academic Tutor</strong>, Utah Valley University - Orem, UT",
                        "Jan 2022 - May 2022"
                    ]
                },
                {
                    "list": [
                        "Provided individual academic support for undergraduate computer science courses"
                    ]
                }
            ],
            [
                {
                    "row": [
                        "<strong>Research Assistant</strong>, BYU Chemical Engineering - Provo, UT",
                        "Jan 2021 - Aug 2021"
                    ]
                },
                {
                    "list": [
                        "Refactored, modularized, and tested a new combustion simulation library, enabling publication"
                    ]
                }
            ],
            [
                {
                    "row": [
                        "<strong>Teaching Assistant</strong>, BYU Chemical Engineering & Computer Science - Provo, UT",
                        "Jan 2019 - Apr 2021"
                    ]
                },
                {
                    "list": [
                        "Provided lab and tutorial sessions for chemical engineering scientific programming course",
                        "Provided individual academic support in computer science courses including Intro to Programming, Algorithms and Data Structures, and Discrete Structures"
                    ]
                }
            ]
        ]
    },
    {
        "section": "Publications",
        "items": [
            [
                {
                    "text": "Garret, Smith, <strong>Bedwell, Joshua</strong>, et al. 'I know I'm being observed:\" Video Interventions to Education Users about Targeted Advertising on Facebook'. <em>Proceedings of the 2024 CHI Conference on Human Factors in Computing Systems</em>, Assosciation for computing Machinery, 2024, <a href=\"https://doi.org/10.1145/3613904.3642885\">https://doi.org/10.1145/3613904.3642885</a>. CHI '24."
                }
            ],
            [
                {
                    "text": "Mondal, Mainack, <strong>Bedwell, Joshua</strong>, et al. 'A Tale of Two Cultures: Comparing Interpersonal Information Disclosure Norms on Twitter'. <em>Proc. ACM Hum. -Comput. Interact</em>., vol. 7, no. CSCW2, Association for Computing Machinery, Oct. 2023, <a href=\"https://doi.org/10.1145/3610045\">https://doi.org/10.1145/3610045</a>."
                }
            ],
            [
                {
                    "text": "Stephens, Victoria B., <strong>Bedwell, Joshua</strong>, et al. 'SootLib: A Soot Model Library for Combustion Simulation'. <em>SoftwareX</em>, vol. 22, Elsevier, May 2023, <a href=\"https://doi.org/10.1016/j.softx.2023.101375.\">https://doi.org/10.1016/j.softx.2023.101375.</a>."
                }
            ]
        ]
    },
    {
        "section": "Projects",
        "items": [
            [
                {
                    "text": "<strong>Transition Biomining - Predictive generation of qPCR primers (2025)</strong>"
                },
                {
                    "list": [
                        "Developing AI model to find the best primer set for qPCR of environmental microbial community",
                        "Leveraging model for successful critical mineral extraction"
                    ]
                }
            ],
            [
                {
                    "text": "<strong>University of British Columbia - Fast phylogenetic mapping of functional anchor genes (2025)</strong>"
                },
                {
                    "list": [
                        "Extending TreeSAPP phylogenetic profiling library with reference packages for several biogeochemical processes",
                        "Developing scripts to efficiently parse TreeSAPP outputs and link disparate feature information across databases"
                    ]
                }
            ],
            [
                {
                    "text": "<strong>Multimodal Brain Tumor Segmentation Challenge 3D CNN (2024)</strong>"
                },
                {
                    "list": [
                        "Designed 3D convolutional neural networks to predict volumes of different tumor types in 3D MRI images",
                        "Created dynamic analysis tools to reduce input size by over 70% while maintaining >95% input detail",
                        "Designed, trained, and validated models with 7M - 117M params, achieved <em>r^2 = 0.53</em> with exploratory model"
                    ]
                }
            ],
            [
                {
                    "text": "<strong>Partners Personnel - Django Deployment (2022-2023)</strong>"
                },
                {
                    "list": [
                        "Designed node-based pipeline architecture, enabling unit testing, serialization, and meeting per-client needs",
                        "Implemented dynamic documentation generation and integration",
                        "Deployed with robust client front end and Azure AD integration"
                    ]
                }
            ]
        ]
    },
    {
        "section": "Skills",
        "items": [
            [
                {
                    "text": "<strong>Languages:</strong> Python, C, C++, Java, Swift, Rust, Javascript"
                },
                {
                    "text": "<strong>Services:</strong> AWS (DynamoDB, API Gateway, Lambda), GitHub Actions CI/CD"
                },
                {
                    "text": "<strong>Technical Methodologies:</strong> Agile Development (Scrum), Scientific Computing, Data Analysis"
                },
                {
                    "text": "<strong>Frameworks:</strong> Django, Flask, TensorFlow, PyTorch, SwiftUI"
                }
            ]
        ]
    }
]